[
  {
    "id":1,
    "name":"Porsche 911 RSR",
    "pictures":"NaN",
    "pictures_1":"NaN",
    "pictures_2":"NaN",
    "pictures_3":"NaN",
    "pictures_4":"NaN",
    "description":"Porsche 911 RSR replica model with a wealth of authentic features, including a rear wing with ‘swan neck’ mounts, extended rear diffuser and aerodynamic side mirrors, plus black spoked rims and realistic head and tail lights. Also includes a detailed cockpit, working differential, independent suspension and a six-cylinder boxer engine with moving pistons positioned in front of the rear axle.\nThis collectible toy car also features an authentic white, red and black color scheme and a sticker sheet for additional detailing.\nOpen the doors to access a cockpit packed with realistic details, including a radar screen, working steering, fire extinguisher system and a track map of the Laguna Seca circuit printed onto the driver’s door.\nCheck out the six-cylinder boxer engine with moving pistons.\nThis set includes 1,580 pieces.\nThis LEGO® Technic™ model is designed to provide an immersive and rewarding building experience.\nSuitable for ages 10+.\nLEGO® Technic™ sets feature realistic movement and mechanisms that introduce young LEGO builders to the universe of engineering in an approachable and realistic way.\nPorsche 911 RSR measures over 5” (13cm) high, 19” (50cm) long and 7” (20cm) wide.",
    "price_shipping_included":"50$",
    "lego_pieces":1580
  },
  {
    "id":2,
    "name":"Lego Batmobile Tumbler",
    "pictures":"NaN",
    "pictures_1":"NaN",
    "pictures_2":"NaN",
    "pictures_3":"NaN",
    "pictures_4":"NaN",
    "description":"Build and display one of cinema’s most iconic vehicles with LEGO® DC Batman™ Batmobile™ Tumbler (76240) – a captivating LEGO brick model created with adults in mind.\nIncludes a buildable Tumbler Batmobile™ with stand, plus Batman™ and The Joker™ minifigures.\nThis armoured crime-fighting machine is a collectible piece of Batman™ memorabilia that will provide great satisfaction long after the hands-on, creative construction work is over.\nIf you’re an adult Batman™ fan or model-making enthusiast, this buildable vehicle is the perfect build-and-display project for you.\nThe vehicle measures over 6 in. (16 cm) high, 17 in. (45 cm) long and 9 in. (25 cm) wide and combines easily with other LEGO® DC Batman™ sets.\nThis collectible display model provides stress-relieving escapism as 2,049 LEGO® bricks slowly transform into the spectacular Tumbler.\nEmbark on this fascinating construction project immediately, thanks to the high-quality printed instructions you’ll find in the box.\nThe range of LEGO® sets created with adults in mind are designed to deliver a satisfying build-and-display experience that will captivate any model-making enthusiast.\nLEGO® building kits meet rigorous industry quality standards to ensure they are consistent, compatible and connect and pull apart perfectly every time – it’s been that way since 1958.\nLEGO® components are dropped, heated, crushed, twisted and analysed to make sure they meet stringent global safety standards.",
    "price_shipping_included":"150$",
    "lego_pieces":2049
  },
  {
    "id":3,
    "name":"LEGO Titanic",
    "pictures":"NaN",
    "pictures_1":"NaN",
    "pictures_2":"NaN",
    "pictures_3":"NaN",
    "pictures_4":"NaN",
    "description":"Build a stunning LEGO® model version of the world’s most famous ocean liner with this LEGO Titanic 10294 model set. With over 9,000 pieces, this set offers a building challenge to savour.\nFaithfully recreate the historical details of the Titanic in this 1:200 scale ship model. Authentic details include over 300 portholes, the iconic bridge, lifeboats, benches, cargo crane and more.\nThe ship splits into 3 sections, giving a view of the detailed interior. Assemble and admire the grand staircase, cabins, dining room, smoking lounge, reading lounge and swimming pool.\nBuild and explore the realistic features of a working ship. Turn the propellers to see the piston engines turn inside.\nThis colossal Titanic ship model makes a historical collectible display piece and comes with a display stand to support each section. Add the name plaque to the bow for the perfect finishing touch.\nProvides a rewarding build for adult LEGO® builders, history lovers and anyone interested in the story of the Titanic. It’s also a great gift idea for collectors of historical memorabilia.\nOne of the largest and longest LEGO® models ever, measuring over 53 in. (135 cm) long, 17.5 in. (44 cm) high, and 6 in. (16 cm) wide.\nThis collectible LEGO® Titanic display model set is part of a range of creative buildable models for adults who love stunning design, intricate details and elegant architecture.\nLEGO® building bricks are manufactured from high-quality materials. They’re consistent, compatible and connect and pull apart easily every time – it’s been that way since 1958.\nWith LEGO® pieces, safety and quality come first. That’s why they’re rigorously tested so you can be sure that the model is as robust as it is beautiful.",
    "price_shipping_included":"100$",
    "lego_pieces":9090
  },
  {
    "id":4,
    "name":"LEGO Technic 42096 Porsche 911 RSR",
    "pictures":"NaN",
    "pictures_1":"NaN",
    "pictures_2":"NaN",
    "pictures_3":"NaN",
    "pictures_4":"NaN",
    "description":"Porsche 911 RSR replica model with a wealth of authentic features, including a rear wing with ‘swan neck’ mounts, extended rear diffuser and aerodynamic side mirrors, plus black spoked rims and realistic head and tail lights. Also includes a detailed cockpit, working differential, independent suspension and a six-cylinder boxer engine with moving pistons positioned in front of the rear axle.\nThis collectible toy car also features an authentic white, red and black color scheme and a sticker sheet for additional detailing.\nOpen the doors to access a cockpit packed with realistic details, including a radar screen, working steering, fire extinguisher system and a track map of the Laguna Seca circuit printed onto the driver’s door.\nCheck out the six-cylinder boxer engine with moving pistons.\nThis set includes 1,580 pieces.\nThis LEGO® Technic™ model is designed to provide an immersive and rewarding building experience.\nSuitable for ages 10+.\nLEGO® Technic™ sets feature realistic movement and mechanisms that introduce young LEGO builders to the universe of engineering in an approachable and realistic way.\nPorsche 911 RSR measures over 5” (13cm) high, 19” (50cm) long and 7” (20cm) wide.",
    "price_shipping_included":"50$",
    "lego_pieces":1580
  },
  {
    "id":5,
    "name":"LEGO Peugeot 9X8 24H Le Mans Hybrid Supercar",
    "pictures":"NaN",
    "pictures_1":"NaN",
    "pictures_2":"NaN",
    "pictures_3":"NaN",
    "pictures_4":"NaN",
    "description":"A celebration for racing car fans – Pay tribute to 100 years of race action at Le Mans in 2023 with this authentic LEGO® Technic PEUGEOT 9X8 24H Le Mans Hybrid Hypercar (42156) model building kit for adults\nStart your engines – Build the hybrid system including V6 piston engine. Check out the opening doors, steering and the suspension on the front and rear designed especially for this model\nRecreate the details – Add the finishing touches to your model with the livery graphics and PEUGEOT and sponsor logos\nDrive through the night – The set includes LEGO® Technic light elements that glow in the dark to capture the atmosphere from a real 24-hour race\nA gift for car enthusiasts – Treat yourself or the car lover in your life to this set, which offers a creative building project with a collectible hypercar model to display\nMeasurements – This LEGO® Technic buildable model measures over 13 cm (5 in.) high, 50 cm (19.5 in.) long and 22 cm (9 in.) wide\nGet the whole picture – The LEGO® Builder app offers a convenient way to store your building instructions and keep track of your builds with tools to zoom in and rotate models in 3D\nWhere will the journey take you? – The LEGO® Technic universe offers an advanced building experience with many buildable models designed especially for adults\nHigh quality – LEGO® Technic components meet rigorous industry standards to ensure they are consistent, compatible and connect reliably every time\nSafety first – LEGO® Technic components are dropped, heated, crushed, twisted and analysed to make sure they meet strict global safety standards",
    "price_shipping_included":"50$",
    "lego_pieces":1775
  },
  {
    "id":6,
    "name":"Lego Marvel 76269 Avengers Towel",
    "pictures":"NaN",
    "pictures_1":"NaN",
    "pictures_2":"NaN",
    "pictures_3":"NaN",
    "pictures_4":"NaN",
    "description":"Landmark model for adults – LEGO® Marvel Avengers Tower (76269) captures the drama, style and scale of the most iconic building in the Avengers Universe\nIconic characters – Features 31 familiar figures, including Iron Man, Wong, Captain America, Thor, Ant-Man, Black Widow, Nick Fury, Hulk, War Machine, Vision, Hawkeye, Wanda Maximoff and The Wasp\nAction on every floor – Familiar scenes include investigating Loki’s scepter in the lab, Captain America's fight with himself on the glass walkways and the Quinjet launching from its hangar\nAuthentic accessories – Fans are rewarded with lots of accessories that evoke memorable movie moments, including the Tesseract, Thor’s hammer and a dropped pager to signal Captain Marvel\nGift for adults – Experienced model-makers and Super Hero movie enthusiasts will find this build-and-display project a highly rewarding gift or personal treat\nDimensions – The completed model measures over 35.5 in. (90 cm) high, 13 in. (34 cm) wide and 10 in. (25 cm) deep. One side of the building and the roof lift off to provide easy access to the interior\nUse your mobile device – A building instructions booklet is provided and, for added convenience, a digital version is also available via the LEGO® Builder app\nRelax and recharge – LEGO® Sets for Adults offer a rewarding build-and-display experience that provides a sense of satisfaction long after the construction work has been completed\nQuality guaranteed – LEGO® components meet stringent industry quality standards to ensure they are consistent, compatible and easy to build with\nSafety assured – LEGO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to make sure they satisfy rigorous global safety standards",
    "price_shipping_included":"75$",
    "lego_pieces":5201
  },
  {
    "id":7,
    "name":"LEGO Technic Bugatti Chiron 42083",
    "pictures":"NaN",
    "pictures_1":"NaN",
    "pictures_2":"NaN",
    "pictures_3":"NaN",
    "pictures_4":"NaN",
    "description":"Exclusive 1:8 scale LEGO® Bugatti Chiron replica model with a wealth of luxurious features, including aerodynamic bodywork with an active rear wing, logoed spoked rims with low-profile tires, detailed brake discs and a W16 engine with moving pistons.\nOpen the doors to access the detailed cockpit featuring a LEGO® Technic™ 8-speed gearbox with movable paddle gearshift and a steering wheel bearing the Bugatti emblem.\nInsert the top speed key to switch the active rear wing from handling to top speed position.\nLift the hood to access a compact storage compartment containing a stylish Bugatti overnight bag.\nCheck out the detailed W16 engine with moving pistons.\nIncludes a unique serial number located beneath the hood.\nComes with a classic Bugatti duo-tone blue color scheme that reflects the brand's signature color, plus a set of cool stickers for additional detailing.\nDelivered in luxurious box packaging.\nIncludes a color collector's booklet with comprehensive building instructions.\nThis LEGO® Technic™ model is designed to provide an immersive and rewarding building experience.\nThis set includes 3,599 pieces.\nSuitable for ages 16+.\nBugatti Chiron measures over 5” (14cm) high, 22” (56cm) long and 12.5”(32cm) wide.",
    "price_shipping_included":"70$",
    "lego_pieces":3599
  },
  {
    "id":8,
    "name":"Lego Star Wars 75313 AT-AT",
    "pictures":"NaN",
    "pictures_1":"NaN",
    "pictures_2":"NaN",
    "pictures_3":"NaN",
    "pictures_4":"NaN",
    "description":"Build and display the first-ever LEGO® Star Wars™ Ultimate Collector Series version of an AT-AT (75313) from the Battle of Hoth in Star Wars: The Empire Strikes Back.\nIncludes 9 LEGO® Star Wars™ minifigures – General Veers, Luke Skywalker, Snowtrooper Commander, 4 Snowtroopers and 2 AT-AT Drivers – plus an information plaque to complete a stunning centrepiece.\nThis epic, buildable model features posable legs and head, opening hatches, cannons with a realistic recoil action, rotating cannons, bomb-drop hatch, and a hook to attach to Luke Skywalker’s line.\nThe AT-AT has panels that lift off to reveal the interior. The main body has space for up to 40 LEGO® minifigures, 4 speeder bikes (2 included) and the included E-Web heavy repeating blaster.\nThis 6,785-piece set offers a complex and rewarding build and makes the best birthday present or holiday gift for yourself, any Star Wars™ connoisseur and advanced LEGO® builder.\nMeasuring over 24.5 in. (62 cm) high, 27 in. (69 cm) long and 9.5 in. (24 cm) wide, this brick-built LEGO® Star Wars™ UCS model makes an awesome display piece in any room.\nAre you a Star Wars™ fan who is new to LEGO® sets? Don’t worry. It comes with clear instructions so you can take your time and tackle this complex build step by step.\nCollectible LEGO® Star Wars™ sets for adults are designed for discerning hobbyists who enjoy fun DIY projects to relax in a mindful and creative way.\nLEGO® components meet stringent industry standards to ensure compatibility and a simple, strong connection for robust builds.\nLEGO® bricks and pieces are tested in almost every way imaginable to make sure that they satisfy rigorous global safety standards.",
    "price_shipping_included":"200$",
    "lego_pieces":6785
  },
  {
    "id":9,
    "name":"LEGO Set 75059 Star Wars: Sandcrawler Ultimate Collector",
    "pictures":"NaN",
    "pictures_1":"NaN",
    "pictures_2":"NaN",
    "pictures_3":"NaN",
    "pictures_4":"NaN",
    "description":"Includes 7 minifigures: Luke Skywalker, Uncle Owen, C-3PO, and 4 Jawas, plus R2-D2, an R2 unit, an R1 series droid, a Gonk droid, R5-D4, and a Treadwell droid\nFeatures 8 tracks with steering function, lowering front ramp, opening side flaps, removable roof, working cranes, motorcycle, opening hatch for easy access to boxes, attachable handles for lifting boxes, and detailed interior including engine compartment, storage compartment, and cockpit\nAlso includes a stockpile of old droids and droid parts\nWeapons include a lightsaber for Luke Skywalker™\nSell droids to Luke and his uncle\nTake good care of your droids\nPretend to suck R2-D2™ into the Sandcrawler™—just like in the movie!\nOwn your own famous vehicle from the classic Star Wars™ universe\nRelive classic moments from Star Wars: Episode IV - A New Hope!",
    "price_shipping_included":"100$",
    "lego_pieces":3296
  },
  {
    "id":10,
    "name":"LEGO 42143 Ferrari Daytona SP3",
    "pictures":"NaN",
    "pictures_1":"NaN",
    "pictures_2":"NaN",
    "pictures_3":"NaN",
    "pictures_4":"NaN",
    "description":"A supercar build for adults – Recreate all the details of the Ferrari Daytona SP3 with this LEGO® Technic Ferrari Daytona SP3 (42143) building set for adults\nFrom the LEGO® Technic Ultimate Car Concept series – The 4th addition to this series of supercar builds: a range of collectible models inspired by some of the world’s most luxurious vehicles\nDesigned in collaboration with Ferrari – Features include steering, a V12 engine, an 8-speed sequential gearbox with paddle shift, opening butterfly doors, a removable roof and shock absorbers\nA car gift for Ferrari fans – This buildable supercar model is designed for adult LEGO® builders and Ferrari fans, offering a detailed building project with a display piece to admire\nMade for display – Includes a decorated display plate and a unique serial number to unlock special online rewards and content\nDimensions – This 1:8 scale supercar model measures over 14 cm (5.5 in.) high, 59 cm (23 in.) long and 25 cm (9.5 in.) wide\nWhere will the journey take you? – The LEGO® Technic universe offers an advanced building experience with many models designed especially for adults\nQuality comes first – LEGO® Technic components meet rigorous industry standards to ensure they are consistent, compatible and connect reliably\nEnsuring safety – LEGO® Technic components are dropped, heated, crushed, twisted and analysed to make sure they meet strict global safety standards",
    "price_shipping_included":"75$",
    "lego_pieces":3778
  },
  {
    "id":11,
    "name":"LEGO Technic McLaren Formula 1 F1 Team Race Car Set 42141",
    "pictures":"NaN",
    "pictures_1":"NaN",
    "pictures_2":"NaN",
    "pictures_3":"NaN",
    "pictures_4":"NaN",
    "description":"A build for Formula 1™ fans – Construct a detailed model replica of McLaren’s 2022 F1 car with this LEGO® Technic McLaren Formula 1 Race Car (42141) building set for adults\nA close collaboration – The LEGO® designers worked closely with the team at McLaren Racing, with both sets of experts developing their version of the car at the same time for the 2022 race season\nModelled on the real car – Includes features like the V6 cylinder engine with moving pistons, steering, suspension and differential for precision cornering\nA project for adults – This McLaren F1 replica offers adult LEGO® builders the opportunity to become immersed in their passion, letting them enjoy a mindful build with a display piece to relish\nMeasurements – This LEGO® Technic McLaren F1 model measures over 5 in. (13 cm) high, 25.5 in. (65 cm) long and 10.5 in. (27 cm) wide\nDetailed building instructions – As well as a guide to constructing the model, the coffee-table-style instructions explain the collaboration between McLaren Racing and the LEGO® designers\nSponsor stickers – Add the finishing touch to your model by adding sponsor stickers, like those seen on a real F1 race car\nWelcome to your zone – The LEGO® Technic universe offers advanced buildable models for adult LEGO fans looking for a rewarding construction experience with a display piece to enjoy\nHigh quality – LEGO® Technic components meet rigorous industry standards to ensure they are consistent, compatible and connect reliably every time\nSafety first – LEGO® Technic components are dropped, heated, crushed, twisted and analysed to make sure they meet strict global safety standards",
    "price_shipping_included":"35$",
    "lego_pieces":1434
  },
  {
    "id":12,
    "name":"LEGO BMW M1000RR",
    "pictures":"NaN",
    "pictures_1":"NaN",
    "pictures_2":"NaN",
    "pictures_3":"NaN",
    "pictures_4":"NaN",
    "description":"A building set for adults – Start your creative engine with this rewarding build. The LEGO® Technic™ BMW M 1000 RR (42130) model kit is the perfect set for adults looking for a hands-on project\nPacked with features – Explore the authentic details in this 1:5 scale model, including the 3-speed (+ neutral) gearbox, steering, front and rear suspension, chain transmission and 4-piston engine\nStylish good looks – Admire the red, white and blue colour scheme and iconic BMW branding. From the tyres to the windshield, no detail has been overlooked in this model version\nStunning BMW gift – Any motorcycle lover would love to receive this impressive model kit. Designed especially for adults, it offers an immersive project with a stylish display piece to enjoy\n1:5 scale – This premium model (dimensions don’t include display stand) measures over 10 in. (27 cm) high, 17 in. (45 cm) long and 6 in. (17 cm) wide\nShow off your passion with pride – The set includes both a display stand and a racing stand, so you can create a real conversation starter with this impressive motorcycle model\nA true collaboration – This building kit is the result of a partnership between BMW and the LEGO® Technic™ design team\nA LEGO® Technic™ build for adults – Part of a range of model kits for adults, offering a great insight into engineering combined with a relaxing building project\nQuality materials – LEGO® Technic™ components meet rigorous industry standards to ensure they are consistent, compatible and connect reliably every time\nPutting safety first – LEGO® Technic™ components are dropped, heated, crushed, twisted and analysed to make sure they meet strict global safety standards",
    "price_shipping_included":"65$",
    "lego_pieces":1921
  },
  {
    "id":13,
    "name":"LEGO 75016 Homing Spider Droid",
    "pictures":"NaN",
    "pictures_1":"NaN",
    "pictures_2":"NaN",
    "pictures_3":"NaN",
    "pictures_4":"NaN",
    "description":"• Includes 4 minifigures with weapons: Stass Allie, a clone trooper, and 2 super battle droids\n• Features articulated legs, a rotating head, an upper rifle that raises, and an upper missile\n• Weapons include a lightsaber and a blaster rifle\n• Move the legs, rotate the head, and fire the missile!\n• Use Stass Allie's Jedi powers to stop the attack!\n• Recreate epic battles from Star Wars™: Episode II Attack of the Clones\n• Recreate an even bigger battle on Geonosis with the 75015 Corporate Alliance Droid™, 75019 AT-TE™, and 75021 Republic Gunship™ models!\n• Measures over 7” (20cm) high, 10” (26cm) long and 7” (19cm) wide",
    "price_shipping_included":"80$",
    "lego_pieces":295
  },
  {
    "id":14,
    "name":"LEGO Technic McLaren Senna GTR (42123)",
    "pictures":"NaN",
    "pictures_1":"NaN",
    "pictures_2":"NaN",
    "pictures_3":"NaN",
    "pictures_4":"NaN",
    "description":"A stunning build for supercar fans, the LEGO® Technic™ McLaren Senna GTR™ 42123 model building kit is packed with realistic details inspired by the iconic original.\nCheck out this supercar toy model’s authentic features, like the detailed V8 engine with moving pistons and dihedral doors that open ‘up and out' in the unmistakable style of the real McLaren.\nEnjoy steering the McLaren toy car using the wheel on top.\nLooking for the best gift ideas for a motorsport fan or supercar lover?This set makes a great choice for kids aged 10 and up who’d love to build and display their own McLaren race car.\nThis awesome track-focused supercar toy model looks great on display and is sure to capture the imagination of any kid or adult with a passion for supercars, motorsport and McLaren.\nModel measures over 3 in. (9 cm) high, 12 in. (32 cm) long and 4 in. (12 cm) wide.\nThis collectible McLaren toy car features eye-catching graphics and colors, just like on the real supercar.\nThe LEGO® Technic™ universe offers advanced building toys for LEGO fans who are ready for their next building challenge.\nLEGO® Technic™ components meet rigorous industry standards to ensure they are consistent, compatible and connect reliably every time – it's been that way since 1958.\nLEGO® Technic™ components are dropped, heated, crushed, twisted and analyzed to make sure they meet strict global safety standards.",
    "price_shipping_included":"40$",
    "lego_pieces":830
  },
  {
    "id":15,
    "name":"Lego Marvel 76210 Hulkbuster",
    "pictures":"NaN",
    "pictures_1":"NaN",
    "pictures_2":"NaN",
    "pictures_3":"NaN",
    "pictures_4":"NaN",
    "description":"Collectible movie colossus – This 4,049-piece LEGO® Marvel Hulkbuster (76210) captures the scale and power of the Hulkbuster MK44 from Marvel Studios’ Avengers: Age of Ultron\nAuthentic details – The model incorporates 3 light-up arc reactors (1 in the chest and 1 in each hand), a fully jointed upper body and a spacious, opening cockpit\nCombine with an Iron Man pilot – The cockpit is designed to hold the LEGO® Marvel Iron Man Figure (76206) – sold separately\nA sure-fire conversation-starter – This display piece also includes an information plate that holds a Tony Stark minifigure carrying tools\nGift for adults – Model-makers and Marvel enthusiasts will find this challenging build-and-display project provides pleasure and fulfilment long after the construction work is over\nFilm memento – Measuring 52 cm (20.5 in) high, 47 cm (18.5 in) wide and 24 cm (9.5 in) deep, this celebration of the Marvel films can be displayed in the home or workplace\nHigh-quality printed instructions – Embark on this construction project as soon as you open the box\nRelax and recharge – The range of premium LEGO® Sets for Adults provides a rewarding build-and-display experience that lasts long after the construction work has been completed\nQuality guaranteed – LEGO® components fulfil stringent industry quality standards to ensure they are consistent, compatible and connect easily every time\nSafety assured – LEGO® components are dropped, heated, crushed, twisted and analysed to make sure they satisfy rigorous global safety standards",
    "price_shipping_included":"100$",
    "lego_pieces":4
  },
  {
    "id":16,
    "name":"LEGO Technic GT4 (42176)",
    "pictures":"NaN",
    "pictures_1":"NaN",
    "pictures_2":"NaN",
    "pictures_3":"NaN",
    "pictures_4":"NaN",
    "description":"Porsche toy car model kit for kids – Give boys and girls aged 10+ a creative project with this remote-controlled LEGO® Technic™ Porsche GT4 e-Performance race car toy\nRemote control car – This toy car set comes with the CONTROL+ app where kids can operate the steering, control the lights and see live data feedback as kids perfect their driving skills\nExplore the features and functions – Inspire kids to play with their model as they steer forwards and backwards then check out the opening doors and working lights\nIncludes a rechargeable battery – This set comes with a rechargeable toy battery (uses a USB-C cable, not included) to power the LEGO® toy car\nA gift for kids – This set makes a gift idea for kids who love car racing toys and Porsche gifts\nA fun way to build– Let the LEGO® Builder app guide kids on an intuitive building adventure, where they can save sets, track progress and zoom in and rotate models in 3D while they build\nAn introduction to engineering – LEGO® Technic™ buildable model sets feature realistic movement and mechanisms to introduce young LEGO builders to the universe of engineering\nMeasurements – A 834-piece set with a model car measuring over 4 in. (10 cm) high, 14.5 in. (37 cm) long and 5.5 in. (15 cm) wide\nSoftware security updates at least until December 2028",
    "price_shipping_included":"50$",
    "lego_pieces":836
  },
  {
    "id":17,
    "name":"LEGO 10255 Assembly square",
    "pictures":"NaN",
    "pictures_1":"NaN",
    "pictures_2":"NaN",
    "pictures_3":"NaN",
    "pictures_4":"NaN",
    "description":"Includes eight minifigures: a dentist, barista, baker, florist, music store assistant, dancer, photographer and a LEGO® fan, plus a baby figure.\nThe three-level Assembly Square features an authentic, elaborate facade with detailed windows and doors, three buildable shop signs, spired tower, decorative roofline and a rooftop terrace, plus a detailed tiled sidewalk with a fountain, outdoor café furniture and two streetlamps. The highly detailed interior includes a bakery, florist’s shop, café, music store, photo studio, dental office, apartment and a dance studio.\nGround level features a bakery with counter, cash register, shelves, opening oven, wedding cake and assorted buildable pastries and treats; a florist’s shop with counter, cash register, garden tools, flower arrangements, bouquets and a blue and yellow macaw parrot element; and a café with espresso machine, counter, bench seating and pie elements.\nMiddle level features a music store with a buildable drum set, two guitars and saxophone element; photo studio with buildable classic camera and adjustable tripod; and a dental office with buildable reclining chair, waiting area, telephone and a sink.\nUpper level features a dance studio with buildable piano and reflective mirror element; an apartment with buildable foldout sofa bed, detailed kitchen, toilet, micro LEGO® train, modular buildings and Eiffel Tower, and access to a rooftop terrace with buildable barbecue, table and a neglected plant.\nAccessory elements include a ballerina skirt, Chihuahua, pretzel, ornamental chicken and candy. Also includes a buildable telephone, grill, baby carriage and buildable lamps.\nRemove the building sections to access the detailed interior.\nAdjust the camera tripod and take photos all around the square.\nRecline the dentist chair and reveal those pearly whites!\nOpen the oven door to remove your freshly-baked pastries.\nFold out the sofa bed and relax while you admire your modular buildings collection!\nCelebrate Modular Buildings with this awesome 10th anniversary LEGO® Creator Expert set!\nThis set offers an age-appropriate build and play experience for ages 16+.\nWith over 4,000 LEGO® pieces, this model will really put your LEGO® building skills to the test!\nNew-for-spring-2017 decorated elements include a dentist torso, dentist window and 2x3 tile with the 10182 Café Corner box front.\nIncludes lots of curved and corner angle tiles, garage doors used as box windows and LEGO® Technic excavator scoops used as roofing elements.\nCollect and build an entire town with the LEGO® Creator Expert Modular Building series 10243 Parisian Restaurant, 10246 Detective’s Office and 10251 Brick Bank.\nMeasures over 13” (35cm) high, 14” (38cm) wide and 9” (25cm) deep.",
    "price_shipping_included":"100$",
    "lego_pieces":4002
  },
  {
    "id":18,
    "name":"LEGO 75290",
    "pictures":"NaN",
    "pictures_1":"NaN",
    "pictures_2":"NaN",
    "pictures_3":"NaN",
    "pictures_4":"NaN",
    "description":"Immerse yourself in a challenging build and then recreate classic Star Wars: A New Hope scenes with this highly detailed LEGO® Star Wars™ Mos Eisley Cantina (75290) Master Builder Series display model.\nThis building kit features 21 LEGO® minifigures, including Chewbacca, Obi-Wan Kenobi, Ponda Baba, Garindan and Labria, plus an R2-D2 LEGO droid figure and a Dewback LEGO figure to bring the Tatooine tavern to life.\nThe Cantina has a removable roof for easy access to the different booths so you can explore the many authentic details and play out stories with the heroes and an array of smugglers, bounty hunters and aliens.\nThe perfect way to click your stress away, this 3,187-piece Star Wars™ construction kit makes a wonderful treat for yourself and a special birthday or holiday gift for the Star Wars fan or hobbyist in your life.\nThe buildable Mos Eisley Cantina model measures over 7.5” (19cm) high, 20.5” (52cm) wide and 23” (58cm) deep when opened up. Alongside the attachable buildings and 2 Landspeeders it makes an awesome display piece.\nNo batteries required – this set offers a hands-on, mindful building experience with LEGO® bricks only. So give yourself a well-earned break and enjoy recreating an iconic Star Wars™ location.\nIncludes easy-to-follow instructions so even LEGO® newcomers can build confidently, plus an illustrated booklet about the set, its model designer and the Star Wars™ stories that inspired it.\nThis LEGO® Star Wars™ set for adults is part of a collection of inspiring LEGO building kits designed for you, the discerning hobbyist, as you look for your next fun and creative DIY project.\nEver since 1958, LEGO® building bricks have met the highest industry standards, which ensures they are consistent, compatible and connect and pull apart easily every time. No need to use the Force!\nLEGO® bricks and pieces are rigorously tested and analyzed so that all Star Wars™ construction sets meet the highest safety and quality standards on planet Earth – and in every galaxy!",
    "price_shipping_included":"90$",
    "lego_pieces":3187
  },
  {
    "id":19,
    "name":"LEGO 21330 Home Alone",
    "pictures":"NaN",
    "pictures_1":"NaN",
    "pictures_2":"NaN",
    "pictures_3":"NaN",
    "pictures_4":"NaN",
    "description":"Celebrate a family-favourite Christmas comedy movie with this LEGO® Ideas Home Alone set (21330), featuring buildable models of the McCallisters’ house, tree house and crooks’ van for play and display.\nThis brick-built movie memorabilia set makes a cool festive gift for millennial Home Alone fans. It includes 5 LEGO® minifigures: Kevin McCallister, Kate McCallister, Harry, Marv and ‘Old Man’ Marley.\nThe house’s walls and roof open up for easy access and it has many fun functions including swinging paint cans, a basement furnace that lights up and a lever to push Kevin down the stairs on his sled.\nDiscover details that spark memories of hilarious movie moments in every room in the house and inside the van (not forgetting the zip line for Kevin to escape to the tree house!).\nBuilding this set is a fun holiday activity for the family, and the house, which measures over 10.5 in. (27 cm) high, 13 in. (34 cm) wide and 14.5 in. (37cm) deep, makes a super festive centrepiece.\nThe bricks in this set are split into 24 bags and the building order follows the movie’s plot. An LR41 battery is included for the LEGO® light brick that illuminates the furnace.\nThis 3,957-piece set includes an illustrated booklet about Home Alone, the set’s fan creator and LEGO® designers, plus step-by-step instructions to guide your immersive, rewarding building experience.\nThis collectible building kit for adults is one of many exciting LEGO® Ideas sets, each created by a fan designer, voted for by thousands of LEGO fans and produced by the LEGO Group.\nLEGO® components meet stringent industry quality standards so you can be sure that they connect simply and securely to create robust builds. It’s been that way since 1958.\nLEGO® building bricks and pieces are thoroughly tested to ensure that every LEGO set satisfies demanding global safety standards.",
    "price_shipping_included":"70$",
    "lego_pieces":3955
  },
  {
    "id":20,
    "name":"Porsche 911 RSR",
    "pictures":"NaN",
    "pictures_1":"NaN",
    "pictures_2":"NaN",
    "pictures_3":"NaN",
    "pictures_4":"NaN",
    "description":"Porsche 911 RSR replica model with a wealth of authentic features, including a rear wing with ‘swan neck’ mounts, extended rear diffuser and aerodynamic side mirrors, plus black spoked rims and realistic head and tail lights. Also includes a detailed cockpit, working differential, independent suspension and a six-cylinder boxer engine with moving pistons positioned in front of the rear axle.\nThis collectible toy car also features an authentic white, red and black color scheme and a sticker sheet for additional detailing.\nOpen the doors to access a cockpit packed with realistic details, including a radar screen, working steering, fire extinguisher system and a track map of the Laguna Seca circuit printed onto the driver’s door.\nCheck out the six-cylinder boxer engine with moving pistons.\nThis set includes 1,580 pieces.\nThis LEGO® Technic™ model is designed to provide an immersive and rewarding building experience.\nSuitable for ages 10+.\nLEGO® Technic™ sets feature realistic movement and mechanisms that introduce young LEGO builders to the universe of engineering in an approachable and realistic way.\nPorsche 911 RSR measures over 5” (13cm) high, 19” (50cm) long and 7” (20cm) wide.",
    "price_shipping_included":"50$",
    "lego_pieces":1580
  },
  {
    "id":21,
    "name":"Lego Batmobile Tumbler",
    "pictures":"NaN",
    "pictures_1":"NaN",
    "pictures_2":"NaN",
    "pictures_3":"NaN",
    "pictures_4":"NaN",
    "description":"Build and display one of cinema’s most iconic vehicles with LEGO® DC Batman™ Batmobile™ Tumbler (76240) – a captivating LEGO brick model created with adults in mind.\nIncludes a buildable Tumbler Batmobile™ with stand, plus Batman™ and The Joker™ minifigures.\nThis armoured crime-fighting machine is a collectible piece of Batman™ memorabilia that will provide great satisfaction long after the hands-on, creative construction work is over.\nIf you’re an adult Batman™ fan or model-making enthusiast, this buildable vehicle is the perfect build-and-display project for you.\nThe vehicle measures over 6 in. (16 cm) high, 17 in. (45 cm) long and 9 in. (25 cm) wide and combines easily with other LEGO® DC Batman™ sets.\nThis collectible display model provides stress-relieving escapism as 2,049 LEGO® bricks slowly transform into the spectacular Tumbler.\nEmbark on this fascinating construction project immediately, thanks to the high-quality printed instructions you’ll find in the box.\nThe range of LEGO® sets created with adults in mind are designed to deliver a satisfying build-and-display experience that will captivate any model-making enthusiast.\nLEGO® building kits meet rigorous industry quality standards to ensure they are consistent, compatible and connect and pull apart perfectly every time – it’s been that way since 1958.\nLEGO® components are dropped, heated, crushed, twisted and analysed to make sure they meet stringent global safety standards.",
    "price_shipping_included":"150$",
    "lego_pieces":2049
  },
  {
    "id":22,
    "name":"LEGO Titanic",
    "pictures":"NaN",
    "pictures_1":"NaN",
    "pictures_2":"NaN",
    "pictures_3":"NaN",
    "pictures_4":"NaN",
    "description":"Build a stunning LEGO® model version of the world’s most famous ocean liner with this LEGO Titanic 10294 model set. With over 9,000 pieces, this set offers a building challenge to savour.\nFaithfully recreate the historical details of the Titanic in this 1:200 scale ship model. Authentic details include over 300 portholes, the iconic bridge, lifeboats, benches, cargo crane and more.\nThe ship splits into 3 sections, giving a view of the detailed interior. Assemble and admire the grand staircase, cabins, dining room, smoking lounge, reading lounge and swimming pool.\nBuild and explore the realistic features of a working ship. Turn the propellers to see the piston engines turn inside.\nThis colossal Titanic ship model makes a historical collectible display piece and comes with a display stand to support each section. Add the name plaque to the bow for the perfect finishing touch.\nProvides a rewarding build for adult LEGO® builders, history lovers and anyone interested in the story of the Titanic. It’s also a great gift idea for collectors of historical memorabilia.\nOne of the largest and longest LEGO® models ever, measuring over 53 in. (135 cm) long, 17.5 in. (44 cm) high, and 6 in. (16 cm) wide.\nThis collectible LEGO® Titanic display model set is part of a range of creative buildable models for adults who love stunning design, intricate details and elegant architecture.\nLEGO® building bricks are manufactured from high-quality materials. They’re consistent, compatible and connect and pull apart easily every time – it’s been that way since 1958.\nWith LEGO® pieces, safety and quality come first. That’s why they’re rigorously tested so you can be sure that the model is as robust as it is beautiful.",
    "price_shipping_included":"100$",
    "lego_pieces":9090
  },
  {
    "id":23,
    "name":"LEGO Technic 42096 Porsche 911 RSR",
    "pictures":"NaN",
    "pictures_1":"NaN",
    "pictures_2":"NaN",
    "pictures_3":"NaN",
    "pictures_4":"NaN",
    "description":"Porsche 911 RSR replica model with a wealth of authentic features, including a rear wing with ‘swan neck’ mounts, extended rear diffuser and aerodynamic side mirrors, plus black spoked rims and realistic head and tail lights. Also includes a detailed cockpit, working differential, independent suspension and a six-cylinder boxer engine with moving pistons positioned in front of the rear axle.\nThis collectible toy car also features an authentic white, red and black color scheme and a sticker sheet for additional detailing.\nOpen the doors to access a cockpit packed with realistic details, including a radar screen, working steering, fire extinguisher system and a track map of the Laguna Seca circuit printed onto the driver’s door.\nCheck out the six-cylinder boxer engine with moving pistons.\nThis set includes 1,580 pieces.\nThis LEGO® Technic™ model is designed to provide an immersive and rewarding building experience.\nSuitable for ages 10+.\nLEGO® Technic™ sets feature realistic movement and mechanisms that introduce young LEGO builders to the universe of engineering in an approachable and realistic way.\nPorsche 911 RSR measures over 5” (13cm) high, 19” (50cm) long and 7” (20cm) wide.",
    "price_shipping_included":"50$",
    "lego_pieces":1580
  },
  {
    "id":24,
    "name":"LEGO Peugeot 9X8 24H Le Mans Hybrid Supercar",
    "pictures":"NaN",
    "pictures_1":"NaN",
    "pictures_2":"NaN",
    "pictures_3":"NaN",
    "pictures_4":"NaN",
    "description":"A celebration for racing car fans – Pay tribute to 100 years of race action at Le Mans in 2023 with this authentic LEGO® Technic PEUGEOT 9X8 24H Le Mans Hybrid Hypercar (42156) model building kit for adults\nStart your engines – Build the hybrid system including V6 piston engine. Check out the opening doors, steering and the suspension on the front and rear designed especially for this model\nRecreate the details – Add the finishing touches to your model with the livery graphics and PEUGEOT and sponsor logos\nDrive through the night – The set includes LEGO® Technic light elements that glow in the dark to capture the atmosphere from a real 24-hour race\nA gift for car enthusiasts – Treat yourself or the car lover in your life to this set, which offers a creative building project with a collectible hypercar model to display\nMeasurements – This LEGO® Technic buildable model measures over 13 cm (5 in.) high, 50 cm (19.5 in.) long and 22 cm (9 in.) wide\nGet the whole picture – The LEGO® Builder app offers a convenient way to store your building instructions and keep track of your builds with tools to zoom in and rotate models in 3D\nWhere will the journey take you? – The LEGO® Technic universe offers an advanced building experience with many buildable models designed especially for adults\nHigh quality – LEGO® Technic components meet rigorous industry standards to ensure they are consistent, compatible and connect reliably every time\nSafety first – LEGO® Technic components are dropped, heated, crushed, twisted and analysed to make sure they meet strict global safety standards",
    "price_shipping_included":"50$",
    "lego_pieces":1775
  },
  {
    "id":25,
    "name":"Lego Marvel 76269 Avengers Towel",
    "pictures":"NaN",
    "pictures_1":"NaN",
    "pictures_2":"NaN",
    "pictures_3":"NaN",
    "pictures_4":"NaN",
    "description":"Landmark model for adults – LEGO® Marvel Avengers Tower (76269) captures the drama, style and scale of the most iconic building in the Avengers Universe\nIconic characters – Features 31 familiar figures, including Iron Man, Wong, Captain America, Thor, Ant-Man, Black Widow, Nick Fury, Hulk, War Machine, Vision, Hawkeye, Wanda Maximoff and The Wasp\nAction on every floor – Familiar scenes include investigating Loki’s scepter in the lab, Captain America's fight with himself on the glass walkways and the Quinjet launching from its hangar\nAuthentic accessories – Fans are rewarded with lots of accessories that evoke memorable movie moments, including the Tesseract, Thor’s hammer and a dropped pager to signal Captain Marvel\nGift for adults – Experienced model-makers and Super Hero movie enthusiasts will find this build-and-display project a highly rewarding gift or personal treat\nDimensions – The completed model measures over 35.5 in. (90 cm) high, 13 in. (34 cm) wide and 10 in. (25 cm) deep. One side of the building and the roof lift off to provide easy access to the interior\nUse your mobile device – A building instructions booklet is provided and, for added convenience, a digital version is also available via the LEGO® Builder app\nRelax and recharge – LEGO® Sets for Adults offer a rewarding build-and-display experience that provides a sense of satisfaction long after the construction work has been completed\nQuality guaranteed – LEGO® components meet stringent industry quality standards to ensure they are consistent, compatible and easy to build with\nSafety assured – LEGO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to make sure they satisfy rigorous global safety standards",
    "price_shipping_included":"75$",
    "lego_pieces":5201
  },
  {
    "id":26,
    "name":"LEGO Technic Bugatti Chiron 42083",
    "pictures":"NaN",
    "pictures_1":"NaN",
    "pictures_2":"NaN",
    "pictures_3":"NaN",
    "pictures_4":"NaN",
    "description":"Exclusive 1:8 scale LEGO® Bugatti Chiron replica model with a wealth of luxurious features, including aerodynamic bodywork with an active rear wing, logoed spoked rims with low-profile tires, detailed brake discs and a W16 engine with moving pistons.\nOpen the doors to access the detailed cockpit featuring a LEGO® Technic™ 8-speed gearbox with movable paddle gearshift and a steering wheel bearing the Bugatti emblem.\nInsert the top speed key to switch the active rear wing from handling to top speed position.\nLift the hood to access a compact storage compartment containing a stylish Bugatti overnight bag.\nCheck out the detailed W16 engine with moving pistons.\nIncludes a unique serial number located beneath the hood.\nComes with a classic Bugatti duo-tone blue color scheme that reflects the brand's signature color, plus a set of cool stickers for additional detailing.\nDelivered in luxurious box packaging.\nIncludes a color collector's booklet with comprehensive building instructions.\nThis LEGO® Technic™ model is designed to provide an immersive and rewarding building experience.\nThis set includes 3,599 pieces.\nSuitable for ages 16+.\nBugatti Chiron measures over 5” (14cm) high, 22” (56cm) long and 12.5”(32cm) wide.",
    "price_shipping_included":"70$",
    "lego_pieces":3599
  },
  {
    "id":27,
    "name":"Lego Star Wars 75313 AT-AT",
    "pictures":"NaN",
    "pictures_1":"NaN",
    "pictures_2":"NaN",
    "pictures_3":"NaN",
    "pictures_4":"NaN",
    "description":"Build and display the first-ever LEGO® Star Wars™ Ultimate Collector Series version of an AT-AT (75313) from the Battle of Hoth in Star Wars: The Empire Strikes Back.\nIncludes 9 LEGO® Star Wars™ minifigures – General Veers, Luke Skywalker, Snowtrooper Commander, 4 Snowtroopers and 2 AT-AT Drivers – plus an information plaque to complete a stunning centrepiece.\nThis epic, buildable model features posable legs and head, opening hatches, cannons with a realistic recoil action, rotating cannons, bomb-drop hatch, and a hook to attach to Luke Skywalker’s line.\nThe AT-AT has panels that lift off to reveal the interior. The main body has space for up to 40 LEGO® minifigures, 4 speeder bikes (2 included) and the included E-Web heavy repeating blaster.\nThis 6,785-piece set offers a complex and rewarding build and makes the best birthday present or holiday gift for yourself, any Star Wars™ connoisseur and advanced LEGO® builder.\nMeasuring over 24.5 in. (62 cm) high, 27 in. (69 cm) long and 9.5 in. (24 cm) wide, this brick-built LEGO® Star Wars™ UCS model makes an awesome display piece in any room.\nAre you a Star Wars™ fan who is new to LEGO® sets? Don’t worry. It comes with clear instructions so you can take your time and tackle this complex build step by step.\nCollectible LEGO® Star Wars™ sets for adults are designed for discerning hobbyists who enjoy fun DIY projects to relax in a mindful and creative way.\nLEGO® components meet stringent industry standards to ensure compatibility and a simple, strong connection for robust builds.\nLEGO® bricks and pieces are tested in almost every way imaginable to make sure that they satisfy rigorous global safety standards.",
    "price_shipping_included":"200$",
    "lego_pieces":6785
  },
  {
    "id":28,
    "name":"LEGO Set 75059 Star Wars: Sandcrawler Ultimate Collector",
    "pictures":"NaN",
    "pictures_1":"NaN",
    "pictures_2":"NaN",
    "pictures_3":"NaN",
    "pictures_4":"NaN",
    "description":"Includes 7 minifigures: Luke Skywalker, Uncle Owen, C-3PO, and 4 Jawas, plus R2-D2, an R2 unit, an R1 series droid, a Gonk droid, R5-D4, and a Treadwell droid\nFeatures 8 tracks with steering function, lowering front ramp, opening side flaps, removable roof, working cranes, motorcycle, opening hatch for easy access to boxes, attachable handles for lifting boxes, and detailed interior including engine compartment, storage compartment, and cockpit\nAlso includes a stockpile of old droids and droid parts\nWeapons include a lightsaber for Luke Skywalker™\nSell droids to Luke and his uncle\nTake good care of your droids\nPretend to suck R2-D2™ into the Sandcrawler™—just like in the movie!\nOwn your own famous vehicle from the classic Star Wars™ universe\nRelive classic moments from Star Wars: Episode IV - A New Hope!",
    "price_shipping_included":"100$",
    "lego_pieces":3296
  },
  {
    "id":29,
    "name":"LEGO 42143 Ferrari Daytona SP3",
    "pictures":"NaN",
    "pictures_1":"NaN",
    "pictures_2":"NaN",
    "pictures_3":"NaN",
    "pictures_4":"NaN",
    "description":"A supercar build for adults – Recreate all the details of the Ferrari Daytona SP3 with this LEGO® Technic Ferrari Daytona SP3 (42143) building set for adults\nFrom the LEGO® Technic Ultimate Car Concept series – The 4th addition to this series of supercar builds: a range of collectible models inspired by some of the world’s most luxurious vehicles\nDesigned in collaboration with Ferrari – Features include steering, a V12 engine, an 8-speed sequential gearbox with paddle shift, opening butterfly doors, a removable roof and shock absorbers\nA car gift for Ferrari fans – This buildable supercar model is designed for adult LEGO® builders and Ferrari fans, offering a detailed building project with a display piece to admire\nMade for display – Includes a decorated display plate and a unique serial number to unlock special online rewards and content\nDimensions – This 1:8 scale supercar model measures over 14 cm (5.5 in.) high, 59 cm (23 in.) long and 25 cm (9.5 in.) wide\nWhere will the journey take you? – The LEGO® Technic universe offers an advanced building experience with many models designed especially for adults\nQuality comes first – LEGO® Technic components meet rigorous industry standards to ensure they are consistent, compatible and connect reliably\nEnsuring safety – LEGO® Technic components are dropped, heated, crushed, twisted and analysed to make sure they meet strict global safety standards",
    "price_shipping_included":"75$",
    "lego_pieces":3778
  },
  {
    "id":30,
    "name":"LEGO Technic McLaren Formula 1 F1 Team Race Car Set 42141",
    "pictures":"NaN",
    "pictures_1":"NaN",
    "pictures_2":"NaN",
    "pictures_3":"NaN",
    "pictures_4":"NaN",
    "description":"A build for Formula 1™ fans – Construct a detailed model replica of McLaren’s 2022 F1 car with this LEGO® Technic McLaren Formula 1 Race Car (42141) building set for adults\nA close collaboration – The LEGO® designers worked closely with the team at McLaren Racing, with both sets of experts developing their version of the car at the same time for the 2022 race season\nModelled on the real car – Includes features like the V6 cylinder engine with moving pistons, steering, suspension and differential for precision cornering\nA project for adults – This McLaren F1 replica offers adult LEGO® builders the opportunity to become immersed in their passion, letting them enjoy a mindful build with a display piece to relish\nMeasurements – This LEGO® Technic McLaren F1 model measures over 5 in. (13 cm) high, 25.5 in. (65 cm) long and 10.5 in. (27 cm) wide\nDetailed building instructions – As well as a guide to constructing the model, the coffee-table-style instructions explain the collaboration between McLaren Racing and the LEGO® designers\nSponsor stickers – Add the finishing touch to your model by adding sponsor stickers, like those seen on a real F1 race car\nWelcome to your zone – The LEGO® Technic universe offers advanced buildable models for adult LEGO fans looking for a rewarding construction experience with a display piece to enjoy\nHigh quality – LEGO® Technic components meet rigorous industry standards to ensure they are consistent, compatible and connect reliably every time\nSafety first – LEGO® Technic components are dropped, heated, crushed, twisted and analysed to make sure they meet strict global safety standards",
    "price_shipping_included":"35$",
    "lego_pieces":1434
  },
  {
    "id":31,
    "name":"LEGO BMW M1000RR",
    "pictures":"NaN",
    "pictures_1":"NaN",
    "pictures_2":"NaN",
    "pictures_3":"NaN",
    "pictures_4":"NaN",
    "description":"A building set for adults – Start your creative engine with this rewarding build. The LEGO® Technic™ BMW M 1000 RR (42130) model kit is the perfect set for adults looking for a hands-on project\nPacked with features – Explore the authentic details in this 1:5 scale model, including the 3-speed (+ neutral) gearbox, steering, front and rear suspension, chain transmission and 4-piston engine\nStylish good looks – Admire the red, white and blue colour scheme and iconic BMW branding. From the tyres to the windshield, no detail has been overlooked in this model version\nStunning BMW gift – Any motorcycle lover would love to receive this impressive model kit. Designed especially for adults, it offers an immersive project with a stylish display piece to enjoy\n1:5 scale – This premium model (dimensions don’t include display stand) measures over 10 in. (27 cm) high, 17 in. (45 cm) long and 6 in. (17 cm) wide\nShow off your passion with pride – The set includes both a display stand and a racing stand, so you can create a real conversation starter with this impressive motorcycle model\nA true collaboration – This building kit is the result of a partnership between BMW and the LEGO® Technic™ design team\nA LEGO® Technic™ build for adults – Part of a range of model kits for adults, offering a great insight into engineering combined with a relaxing building project\nQuality materials – LEGO® Technic™ components meet rigorous industry standards to ensure they are consistent, compatible and connect reliably every time\nPutting safety first – LEGO® Technic™ components are dropped, heated, crushed, twisted and analysed to make sure they meet strict global safety standards",
    "price_shipping_included":"65$",
    "lego_pieces":1921
  },
  {
    "id":32,
    "name":"LEGO 75016 Homing Spider Droid",
    "pictures":"NaN",
    "pictures_1":"NaN",
    "pictures_2":"NaN",
    "pictures_3":"NaN",
    "pictures_4":"NaN",
    "description":"• Includes 4 minifigures with weapons: Stass Allie, a clone trooper, and 2 super battle droids\n• Features articulated legs, a rotating head, an upper rifle that raises, and an upper missile\n• Weapons include a lightsaber and a blaster rifle\n• Move the legs, rotate the head, and fire the missile!\n• Use Stass Allie's Jedi powers to stop the attack!\n• Recreate epic battles from Star Wars™: Episode II Attack of the Clones\n• Recreate an even bigger battle on Geonosis with the 75015 Corporate Alliance Droid™, 75019 AT-TE™, and 75021 Republic Gunship™ models!\n• Measures over 7” (20cm) high, 10” (26cm) long and 7” (19cm) wide",
    "price_shipping_included":"80$",
    "lego_pieces":295
  },
  {
    "id":33,
    "name":"LEGO Technic McLaren Senna GTR (42123)",
    "pictures":"NaN",
    "pictures_1":"NaN",
    "pictures_2":"NaN",
    "pictures_3":"NaN",
    "pictures_4":"NaN",
    "description":"A stunning build for supercar fans, the LEGO® Technic™ McLaren Senna GTR™ 42123 model building kit is packed with realistic details inspired by the iconic original.\nCheck out this supercar toy model’s authentic features, like the detailed V8 engine with moving pistons and dihedral doors that open ‘up and out' in the unmistakable style of the real McLaren.\nEnjoy steering the McLaren toy car using the wheel on top.\nLooking for the best gift ideas for a motorsport fan or supercar lover?This set makes a great choice for kids aged 10 and up who’d love to build and display their own McLaren race car.\nThis awesome track-focused supercar toy model looks great on display and is sure to capture the imagination of any kid or adult with a passion for supercars, motorsport and McLaren.\nModel measures over 3 in. (9 cm) high, 12 in. (32 cm) long and 4 in. (12 cm) wide.\nThis collectible McLaren toy car features eye-catching graphics and colors, just like on the real supercar.\nThe LEGO® Technic™ universe offers advanced building toys for LEGO fans who are ready for their next building challenge.\nLEGO® Technic™ components meet rigorous industry standards to ensure they are consistent, compatible and connect reliably every time – it's been that way since 1958.\nLEGO® Technic™ components are dropped, heated, crushed, twisted and analyzed to make sure they meet strict global safety standards.",
    "price_shipping_included":"40$",
    "lego_pieces":830
  },
  {
    "id":34,
    "name":"Lego Marvel 76210 Hulkbuster",
    "pictures":"NaN",
    "pictures_1":"NaN",
    "pictures_2":"NaN",
    "pictures_3":"NaN",
    "pictures_4":"NaN",
    "description":"Collectible movie colossus – This 4,049-piece LEGO® Marvel Hulkbuster (76210) captures the scale and power of the Hulkbuster MK44 from Marvel Studios’ Avengers: Age of Ultron\nAuthentic details – The model incorporates 3 light-up arc reactors (1 in the chest and 1 in each hand), a fully jointed upper body and a spacious, opening cockpit\nCombine with an Iron Man pilot – The cockpit is designed to hold the LEGO® Marvel Iron Man Figure (76206) – sold separately\nA sure-fire conversation-starter – This display piece also includes an information plate that holds a Tony Stark minifigure carrying tools\nGift for adults – Model-makers and Marvel enthusiasts will find this challenging build-and-display project provides pleasure and fulfilment long after the construction work is over\nFilm memento – Measuring 52 cm (20.5 in) high, 47 cm (18.5 in) wide and 24 cm (9.5 in) deep, this celebration of the Marvel films can be displayed in the home or workplace\nHigh-quality printed instructions – Embark on this construction project as soon as you open the box\nRelax and recharge – The range of premium LEGO® Sets for Adults provides a rewarding build-and-display experience that lasts long after the construction work has been completed\nQuality guaranteed – LEGO® components fulfil stringent industry quality standards to ensure they are consistent, compatible and connect easily every time\nSafety assured – LEGO® components are dropped, heated, crushed, twisted and analysed to make sure they satisfy rigorous global safety standards",
    "price_shipping_included":"100$",
    "lego_pieces":4
  },
  {
    "id":35,
    "name":"LEGO Technic GT4 (42176)",
    "pictures":"NaN",
    "pictures_1":"NaN",
    "pictures_2":"NaN",
    "pictures_3":"NaN",
    "pictures_4":"NaN",
    "description":"Porsche toy car model kit for kids – Give boys and girls aged 10+ a creative project with this remote-controlled LEGO® Technic™ Porsche GT4 e-Performance race car toy\nRemote control car – This toy car set comes with the CONTROL+ app where kids can operate the steering, control the lights and see live data feedback as kids perfect their driving skills\nExplore the features and functions – Inspire kids to play with their model as they steer forwards and backwards then check out the opening doors and working lights\nIncludes a rechargeable battery – This set comes with a rechargeable toy battery (uses a USB-C cable, not included) to power the LEGO® toy car\nA gift for kids – This set makes a gift idea for kids who love car racing toys and Porsche gifts\nA fun way to build– Let the LEGO® Builder app guide kids on an intuitive building adventure, where they can save sets, track progress and zoom in and rotate models in 3D while they build\nAn introduction to engineering – LEGO® Technic™ buildable model sets feature realistic movement and mechanisms to introduce young LEGO builders to the universe of engineering\nMeasurements – A 834-piece set with a model car measuring over 4 in. (10 cm) high, 14.5 in. (37 cm) long and 5.5 in. (15 cm) wide\nSoftware security updates at least until December 2028",
    "price_shipping_included":"50$",
    "lego_pieces":836
  },
  {
    "id":36,
    "name":"LEGO 10255 Assembly square",
    "pictures":"NaN",
    "pictures_1":"NaN",
    "pictures_2":"NaN",
    "pictures_3":"NaN",
    "pictures_4":"NaN",
    "description":"Includes eight minifigures: a dentist, barista, baker, florist, music store assistant, dancer, photographer and a LEGO® fan, plus a baby figure.\nThe three-level Assembly Square features an authentic, elaborate facade with detailed windows and doors, three buildable shop signs, spired tower, decorative roofline and a rooftop terrace, plus a detailed tiled sidewalk with a fountain, outdoor café furniture and two streetlamps. The highly detailed interior includes a bakery, florist’s shop, café, music store, photo studio, dental office, apartment and a dance studio.\nGround level features a bakery with counter, cash register, shelves, opening oven, wedding cake and assorted buildable pastries and treats; a florist’s shop with counter, cash register, garden tools, flower arrangements, bouquets and a blue and yellow macaw parrot element; and a café with espresso machine, counter, bench seating and pie elements.\nMiddle level features a music store with a buildable drum set, two guitars and saxophone element; photo studio with buildable classic camera and adjustable tripod; and a dental office with buildable reclining chair, waiting area, telephone and a sink.\nUpper level features a dance studio with buildable piano and reflective mirror element; an apartment with buildable foldout sofa bed, detailed kitchen, toilet, micro LEGO® train, modular buildings and Eiffel Tower, and access to a rooftop terrace with buildable barbecue, table and a neglected plant.\nAccessory elements include a ballerina skirt, Chihuahua, pretzel, ornamental chicken and candy. Also includes a buildable telephone, grill, baby carriage and buildable lamps.\nRemove the building sections to access the detailed interior.\nAdjust the camera tripod and take photos all around the square.\nRecline the dentist chair and reveal those pearly whites!\nOpen the oven door to remove your freshly-baked pastries.\nFold out the sofa bed and relax while you admire your modular buildings collection!\nCelebrate Modular Buildings with this awesome 10th anniversary LEGO® Creator Expert set!\nThis set offers an age-appropriate build and play experience for ages 16+.\nWith over 4,000 LEGO® pieces, this model will really put your LEGO® building skills to the test!\nNew-for-spring-2017 decorated elements include a dentist torso, dentist window and 2x3 tile with the 10182 Café Corner box front.\nIncludes lots of curved and corner angle tiles, garage doors used as box windows and LEGO® Technic excavator scoops used as roofing elements.\nCollect and build an entire town with the LEGO® Creator Expert Modular Building series 10243 Parisian Restaurant, 10246 Detective’s Office and 10251 Brick Bank.\nMeasures over 13” (35cm) high, 14” (38cm) wide and 9” (25cm) deep.",
    "price_shipping_included":"100$",
    "lego_pieces":4002
  },
  {
    "id":37,
    "name":"LEGO 75290",
    "pictures":"NaN",
    "pictures_1":"NaN",
    "pictures_2":"NaN",
    "pictures_3":"NaN",
    "pictures_4":"NaN",
    "description":"Immerse yourself in a challenging build and then recreate classic Star Wars: A New Hope scenes with this highly detailed LEGO® Star Wars™ Mos Eisley Cantina (75290) Master Builder Series display model.\nThis building kit features 21 LEGO® minifigures, including Chewbacca, Obi-Wan Kenobi, Ponda Baba, Garindan and Labria, plus an R2-D2 LEGO droid figure and a Dewback LEGO figure to bring the Tatooine tavern to life.\nThe Cantina has a removable roof for easy access to the different booths so you can explore the many authentic details and play out stories with the heroes and an array of smugglers, bounty hunters and aliens.\nThe perfect way to click your stress away, this 3,187-piece Star Wars™ construction kit makes a wonderful treat for yourself and a special birthday or holiday gift for the Star Wars fan or hobbyist in your life.\nThe buildable Mos Eisley Cantina model measures over 7.5” (19cm) high, 20.5” (52cm) wide and 23” (58cm) deep when opened up. Alongside the attachable buildings and 2 Landspeeders it makes an awesome display piece.\nNo batteries required – this set offers a hands-on, mindful building experience with LEGO® bricks only. So give yourself a well-earned break and enjoy recreating an iconic Star Wars™ location.\nIncludes easy-to-follow instructions so even LEGO® newcomers can build confidently, plus an illustrated booklet about the set, its model designer and the Star Wars™ stories that inspired it.\nThis LEGO® Star Wars™ set for adults is part of a collection of inspiring LEGO building kits designed for you, the discerning hobbyist, as you look for your next fun and creative DIY project.\nEver since 1958, LEGO® building bricks have met the highest industry standards, which ensures they are consistent, compatible and connect and pull apart easily every time. No need to use the Force!\nLEGO® bricks and pieces are rigorously tested and analyzed so that all Star Wars™ construction sets meet the highest safety and quality standards on planet Earth – and in every galaxy!",
    "price_shipping_included":"90$",
    "lego_pieces":3187
  },
  {
    "id":38,
    "name":"LEGO 21330 Home Alone",
    "pictures":"NaN",
    "pictures_1":"NaN",
    "pictures_2":"NaN",
    "pictures_3":"NaN",
    "pictures_4":"NaN",
    "description":"Celebrate a family-favourite Christmas comedy movie with this LEGO® Ideas Home Alone set (21330), featuring buildable models of the McCallisters’ house, tree house and crooks’ van for play and display.\nThis brick-built movie memorabilia set makes a cool festive gift for millennial Home Alone fans. It includes 5 LEGO® minifigures: Kevin McCallister, Kate McCallister, Harry, Marv and ‘Old Man’ Marley.\nThe house’s walls and roof open up for easy access and it has many fun functions including swinging paint cans, a basement furnace that lights up and a lever to push Kevin down the stairs on his sled.\nDiscover details that spark memories of hilarious movie moments in every room in the house and inside the van (not forgetting the zip line for Kevin to escape to the tree house!).\nBuilding this set is a fun holiday activity for the family, and the house, which measures over 10.5 in. (27 cm) high, 13 in. (34 cm) wide and 14.5 in. (37cm) deep, makes a super festive centrepiece.\nThe bricks in this set are split into 24 bags and the building order follows the movie’s plot. An LR41 battery is included for the LEGO® light brick that illuminates the furnace.\nThis 3,957-piece set includes an illustrated booklet about Home Alone, the set’s fan creator and LEGO® designers, plus step-by-step instructions to guide your immersive, rewarding building experience.\nThis collectible building kit for adults is one of many exciting LEGO® Ideas sets, each created by a fan designer, voted for by thousands of LEGO fans and produced by the LEGO Group.\nLEGO® components meet stringent industry quality standards so you can be sure that they connect simply and securely to create robust builds. It’s been that way since 1958.\nLEGO® building bricks and pieces are thoroughly tested to ensure that every LEGO set satisfies demanding global safety standards.",
    "price_shipping_included":"70$",
    "lego_pieces":3955
  }
]